import React from 'react'

import Actions from 'components/Actions'

import char from '../imgs/char.png'
import name from '../imgs/title.png'

class Scene2 extends React.Component {
  state = {
    page: 1,
  }

  changePage = (page) => {
    this.setState({ page })
  }

  render () {
    const { scene, changeScene } = this.props
    const { page } = this.state

    const title = (
      <div className='title'>
        <h1>เรื่อง การกระทำความผิดตามพระราชบัญญัติ<br />ว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ พ.ศ. 2560</h1>
      </div>
    )

    const page1 = (
      <div className='page-1'>
        <div className='title'>
          <h1>บทเรียนที่ 3</h1>
          <p>เรื่อง การกระทำความผิดตามพระราชบัญญัติ<br />ว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ พ.ศ. 2560</p>
        </div>
        <img src={char} alt='char' className='char' />
        <button className='start' onClick={() => this.changePage(page + 1)}>START</button>
      </div>
    )

    const page2 = (
      <div className='page-2'>
        {title}
        <img src={char} alt='char' className='char' />
        <h3>แนะนำการใช้งาน</h3>
        <ul>
          <li><p>1. นักเรียนควรศึกษาเนื้อหาบทเรียน</p></li>
          <li><p>2. ทำเกมการทดสอบหลังเรียน</p></li>
          <li><p>3. ถ้าทำเกมการสอบหลังเรียนไม่ผ่าน ควรกลับมาศึกษาเนื้อหาอีกครั้ง</p></li>
        </ul>
      </div>
    )

    const page3 = (
      <div className='page-3'>
        {title}
        <img src={char} alt='char' className='char' />
        <h3>จุดประสงค์การเรียนรู้</h3>
        <p className='content'>
          เลือกการกระทำความผิดที่มีผลตามพระราชบัญญัติว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ (ฉบับที่2) พ.ศ. 2560 ได้
        </p>
      </div>
    )

    const page4 = (
      <div className='page-4'>
        {title}
        <img src={char} alt='char' className='char' />
        <h3>เนื้อหาบทเรียน</h3>
        <p className='content'>
          การกระทำความผิดและบทลงโทษที่มีผลตามพระราชบัญญัติว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ (ฉบับที่2) พ.ศ. 2560
        </p>
      </div>
    )

    const page5 = (
      <div className='page-5'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 5
            <span>ผู้ใดเข้าถึงโดยมิชอบซึ่งระบบคอมพิวเตอร์ที่มีมาตรการป้องกันการเข้าถึงโดยเฉพาะและมาตรการนั้นมิได้มีไว้สำหรับตน</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 6 เดือน ปรับไม่เกิน 10,000 บาท</span>
          </h4>
        </div>
        <ul className='content2'>
          <li>การเข้าไปเจาะข้อมูลทางคอมพิวเตอร์ของบุคคลอื่น โดยที่เจ้าของข้อมูลไม่ได้อนุญาต</li>
          <li>การปล่อยไวรัสมัลแวร์เข้าคอมพิวเตอร์บุคคลอื่น เพื่อเจาะข้อมูลบางอย่าง</li>
        </ul>
      </div>
    )

    const page6 = (
      <div className='page-6'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 6
            <span>ผู้ใดล่วงรู้มาตรการป้องกันการเข้าถึงระบบคอมพิวเตอร์ที่ผู้อื่นจัดทำขึ้นเป็นการเฉพาะ ถ้านำมาตรการดังกล่าวไปเปิดเผยโดยมิชอบในประการที่น่าจะเกิดความเสียหายแก่ผู้อื่น</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 1 ปี ปรับไม่เกิน 20,000 บาท</span>
          </h4>
        </div>
        <ul className='content2'>
          <li>การเข้าไปเจาะข้อมูลลับทางคอมพิวเตอร์ของบุคคลอื่น โดยที่เจ้าของข้อมูลไม่ได้อนุญาต แล้วนำข้อมูลนั้นไปเปิดเผยให้เจ้าของข้อมูลเสื่อมเสีย</li>
          <li>การปล่อยไวรัสมัลแวร์เข้าคอมพิวเตอร์บุคคลอื่น เพื่อเจาะข้อมูลบางอย่าง แล้วนำข้อมูลไปเผยแพร่</li>
        </ul>
      </div>
    )

    const page7 = (
      <div className='page-7'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 7
            <span>ผู้ใดเข้าถึงโดยมิชอบซึ่งข้อมูลคอมพิวเตอร์ที่มีมาตรการป้องกันการเข้าถึงโดยเฉพาะ และมาตรการนั้นมิได้มีไว้สำหรับตน</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 2 ปี ปรับไม่เกิน 40,000 บาท</span>
          </h4>
        </div>
        <ul className='content2'>
          <li>การเข้าไปเจาะข้อมูลทางคอมพิวเตอร์ของบุคคลอื่นที่มีการตั้งรหัสการเข้าถึงเอาไว้โดยไม่ได้รับอนุญาต</li>
          <li>การเจาะรหัสผ่านคอมพิวเตอร์ของบุคคลอื่น เพื่อเข้าถึงข้อมูลบางอย่าง</li>
        </ul>
      </div>
    )

    const page8 = (
      <div className='page-8'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 8
            <span>ผู้ใดกระทำด้วยประการใดโดยมิชอบด้วยวิธีการทางอิเล็กทรอนิกส์เพื่อดักรับไว้ ซึ่งข้อมูลคอมพิวเตอร์ของผู้อื่นที่อยู่ระหว่างการส่งในระบบคอมพิวเตอร์ และข้อมูลคอมพิวเตอร์นั้น มิได้มีไว้เพื่อประโยชน์สาธารณะหรือเพื่อให้บุคคลทั่วไปใช้ประโยชน์ได้</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 3 ปี ปรับไม่เกิน 60,000 บาท</span>
          </h4>
        </div>
        <ul className='content2'>
          <li>การเข้าไปเจาะข้อมูลทางการเงินส่วนบุคคลผ่านระบบอิเล็กทรอนิกส์ แล้วนำข้อมูลไปขายให้กับบริษัทต่างๆ</li>
          <li>การปล่อยไวรัสมัลแวร์เข้าคอมพิวเตอร์บุคคลอื่น เพื่อเจาะข้อมูลส่วนบุคคล</li>
        </ul>
      </div>
    )

    const page9 = (
      <div className='page-9'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 9
            <span>ผู้ใดทำให้เสียหาย ทำลาย แก้ไข เปลี่ยนแปลง หรือเพิ่มเติมไม่ว่าทั้งหมดหรือ บางส่วน ซึ่งข้อมูลคอมพิวเตอร์ของผู้อื่นโดยมิชอบ</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 5 ปี ปรับไม่เกิน 100,000 บาท</span>
          </h4>
        </div>
        <ul className='content2'>
          <li>การเข้าไปขัดขวางทำร้ายระบบเว็บไซต์ของบุคคลอื่นให้ใช้งานไม่ได้ </li>
        </ul>
      </div>
    )

    const page10 = (
      <div className='page-10'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 10
            <span>ผู้ใดกระทำด้วยประการใดโดยมิชอบ เพื่อให้การทำงานของระบบคอมพิวเตอร์ ของผู้อื่นถูกระงับ ชะลอ ขัดขวาง หรือรบกวนจนไม่สามารถทำงานตามปกติได้</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 5 ปี ปรับไม่เกิน 100,000 บาท</span>
          </h4>
        </div>
        <ul className='content2'>
          <li>การเข้าไปขัดขวางทำร้ายระบบเว็บไซต์ของบุคคลอื่นให้ใช้งานไม่ได้ </li>
        </ul>
      </div>
    )

    const page11 = (
      <div className='page-11'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 11
            <span>ผู้ใดส่งข้อมูลคอมพิวเตอร์หรือจดหมายอิเล็กทรอนิกส์แก่บุคคลอื่นโดยปกปิด หรือปลอมแปลงแหล่งที่มาของการส่งข้อมูลดังกล่าว อันเป็นการรบกวนการใช้ระบบคอมพิวเตอร์ของบุคคลอื่นโดยปกติสุข</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>ปรับไม่เกิน 100,000 บาท</span>
          </h4>
        </div>
      </div>
    )

    const page12 = (
      <div className='page-12'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 11
            <span>ผู้ใดส่งข้อมูลคอมพิวเตอร์หรือจดหมายอิเล็กทรอนิกส์แก่บุคคลอื่นอันมีลักษณะเป็นการก่อให้เกิดความเดือดร้อนรำคาญแก่ผู้รับข้อมูลคอมพิวเตอร์หรือจดหมายอิเล็กทรอนิกส์ โดยไม่เปิดโอกาสให้ผู้รับสามารถบอกเลิกหรือแจ้งความประสงค์เพื่อปฏิเสธการตอบรับได้โดยง่าย</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>ปรับไม่เกิน 200,000 บาท</span>
          </h4>
        </div>
        <ul className='content2'>
          <li>ส่ง SMS โฆษณา</li>
          <li>การฝากร้านใน Facebook, IG</li>
          <li>ส่ง Email ขายของ</li>
        </ul>
      </div>
    )

    const page13 = (
      <div className='page-13'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 12
            <span>ผู้ใดส่งข้อมูลคอมพิวเตอร์หรือจดหมายอิเล็กทรอนิกส์แก่บุคคลอื่นอันมีลักษณะเป็นการก่อให้เกิดความเดือดร้อนรำคาญแก่ผู้รับถ้าการกระทำความผิดตามมาตรา 5 มาตรา 6 มาตรา 7 มาตรา 8 หรือมาตรา 11 เป็นการกระทำต่อข้อมูลคอมพิวเตอร์หรือระบบคอมพิวเตอร์ที่เกี่ยวกับการรักษาความมั่นคงปลอดภัยของประเทศ ความปลอดภัยสาธารณะ ความมั่นคงในทางเศรษฐกิจของประเทศหรือโครงสร้างพื้นฐานอันเป็นประโยชน์สาธารณะหรือจดหมายอิเล็กทรอนิกส์ โดยไม่เปิดโอกาสให้ผู้รับสามารถบอกเลิกหรือแจ้งความประสงค์เพื่อปฏิเสธการตอบรับได้โดยง่าย</span>
          </h4>
          <h4>>>> บทลงโทษ
            <ul>
              <li>จำคุกตั้งแต่ 1 ปี - 7 ปี  ปรับ 20,000 - 140,000 บาท ถ้าการกระทำความผิดตามวรรคหนึ่งเป็นเหตุให้เกิดความเสียหายต่อข้อมูลคอมพิวเตอร์ หรือระบบคอมพิวเตอร์ดังกล่าว</li>
              <li>จำคุกตั้งแต่ 1 ปี – 10 ปี  ปรับ 20,000 - 200,000 บาท ถ้าการกระทำความผิดตามมาตรา 9 หรือมาตรา 10 เป็นการกระทำต่อข้อมูลคอมพิวเตอร์หรือระบบคอมพิวเตอร์ตามวรรคหนึ่ง</li>
              <li>จำคุกตั้งแต่ 3 ปี – 15 ปี  ปรับ 60,000 - 300,000 บาท ถ้าการกระทำความผิดตามวรรคหนึ่งหรือวรรคสามโดยมิได้มีเจตนาฆ่า แต่เป็นเหตุให้บุคคลอื่นถึงแก่ความตาย</li>
              <li>จำคุกตั้งแต่ 5 ปี – 20 ปี  ปรับ 100,000 - 400,000 บาท</li>
            </ul>
          </h4>
        </div>
      </div>
    )

    const page14 = (
      <div className='page-14'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 12/1
            <span>ถ้าการกระทำความผิดตามมาตรา 9 หรือมาตรา 10 เป็นเหตุให้เกิดอันตรายแก่บุคคลอื่นหรือทรัพย์สินของผู้อื่น</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 10 ปี ปรับไม่เกิน 200,000 บาท</span>
          </h4>
          <p>>>> ถ้าการกระทำความผิดตามมาตรา 9 หรือมาตรา 10 โดยมิได้มีเจตนาฆ่า แต่เป็นเหตุให้บุคคลอื่นถึงแก่ความตาย
            <span>จำคุกตั้งแต่ 5 - 20 ปี ปรับ 100,000 – 400,000</span>
          </p>
        </div>
      </div>
    )

    const page15 = (
      <div className='page-15'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 13
            <span>ผู้ใดจำหน่ายหรือเผยแพร่ชุดคำสั่งที่จัดทำขึ้นโดยเฉพาะเพื่อนำไปใช้เป็นเครื่องมือในการกระทำความผิดตามมาตรา 5 มาตรา 6 มาตรา 7 มาตรา 8 มาตรา 9 มาตรา 10 หรือ มาตรา 11</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 5 ปี ปรับ 20,000 บาท</span>
          </h4>
          <p>>>> ผู้ใดจำหน่ายหรือเผยแพร่ชุดคำสั่งที่จัดทำขึ้นโดยเฉพาะเพื่อนำไปใช้เป็นเครื่องมือในการกระทำความผิดตามมาตรา 12 วรรคหนึ่งหรือวรรคสาม
            <span>จำคุกไม่เกิน 2 ปี ปรับไม่เกิน 40,000 บาท</span>
          </p>
        </div>
      </div>
    )

    const page16 = (
      <div className='page-16'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 14 (1)
            <span>นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ที่บิดเบือน หรือปลอมไม่ว่าทั้งหมดหรือบางส่วน หรือข้อมูลคอมพิวเตอร์อันเป็นเท็จ โดยประการที่น่าจะเกิดความเสียหายแก่ประชาชน อันมิใช่การกระทำความผิดฐานหมิ่นประมาทตามประมวลกฎหมายอาญา</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 5 ปี ปรับไม่เกิน 100,000 บาท</span>
          </h4>
        </div>
        <ul className='content2'>
          <li>การโพสต์ข่าวที่ไม่เป็นจริง หรือข่าวปลอมในสื่อสังคมออนไลน์</li>
          <li>การหลอกลวงเอาเงินลูกค้า และไม่มีการส่งมอบของให้จริง</li>
        </ul>
      </div>
    )

    const page17 = (
      <div className='page-17'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 14 (2)
            <span>นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์อันเป็นเท็จ โดยประการที่น่าจะเกิดความเสียหายต่อการรักษาความมั่นคงปลอดภัยของประเทศ ความปลอดภัยสาธารณะ ความมั่นคง ในทางเศรษฐกิจของประเทศ หรือโครงสร้างพื้นฐานอันเป็นประโยชน์สาธารณะของประเทศ หรือก่อให้เกิดความตื่นตระหนกแก่ประชาชน</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 5 ปี ปรับไม่เกิน 100,000 บาท</span>
          </h4>
        </div>
        <ul className='content2'>
          <li>การโพสต์ข้อมูลความผิดเกี่ยวกับความมั่งคงปลอดภัย</li>
        </ul>
      </div>
    )

    const page18 = (
      <div className='page-18'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 14 (3)
            <span>นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ใดๆ อันเป็นความผิดเกี่ยวกับความมั่นคงแห่งราชอาณาจักรหรือความผิดเกี่ยวกับการก่อการร้ายตามประมวลกฎหมายอาญา</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 5 ปี ปรับไม่เกิน 100,000 บาท</span>
          </h4>
        </div>
        <ul className='content2'>
          <li>การโพสต์ข้อมูลความผิดเกี่ยวกับความมั่นคง ก่อการร้าย</li>
        </ul>
      </div>
    )

    const page19 = (
      <div className='page-19'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 14 (4)
            <span>นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ใดๆ ที่มีลักษณะอันลามกและข้อมูลคอมพิวเตอร์นั้นประชาชนทั่วไปอาจเข้าถึงได้</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 5 ปี ปรับไม่เกิน 100,000 บาท</span>
          </h4>
        </div>
        <ul className='content2'>
          <li>การโพสต์ข้อมูลลามกที่ประชาชนเข้าถึงได้</li>
        </ul>
      </div>
    )

    const page20 = (
      <div className='page-20'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 14 (5)
            <span>ผู้ใดเผยแพร่หรือส่งต่อซึ่งข้อมูลคอมพิวเตอร์โดยรู้อยู่แล้วว่าเป็นข้อมูลคอมพิวเตอร์ ตาม (1) (2) (3) หรือ (4)</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 5 ปี ปรับไม่เกิน 100,000 บาท</span>
          </h4>
        </div>
        <ul className='content2'>
          <li>การกด Share ข้อมูลที่มีเนื้อหาเข้าข่ายความผิด</li>
        </ul>
      </div>
    )

    const page21 = (
      <div className='page-21'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 15
            <span>ผู้ให้บริการผู้ใดให้ความร่วมมือ ยินยอม หรือรู้เห็นเป็นใจให้มีการกระทำความผิดตามมาตรา 14 ในระบบคอมพิวเตอร์ที่อยู่ในความควบคุมของตน</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 5 ปี ปรับไม่เกิน 100,000 บาท</span>
          </h4>
        </div>
        <ul className='content2'>
          <li>การแสดงความคิดเห็นในเพจที่มีเนื้อหาผิดกฎหมาย แต่ถ้าหากแอดมินเพจตรวจสอบแล้วพบเจอ และลบออกจะถือว่าเป็นผู้ที่พ้นความผิด</li>
        </ul>
      </div>
    )

    const page22 = (
      <div className='page-22'>
        {title}
        <img src={char} alt='char' className='char2' />
        <div className='content1'>
          <h4>>>> มาตราที่ 16
            <span>ผู้ใดนำเข้าสู่ระบบคอมพิวเตอร์ที่ประชาชนทั่วไปอาจเข้าถึงได้ซึ่งข้อมูลคอมพิวเตอร์ ที่ปรากฏเป็นภาพของผู้อื่น และภาพนั้นเป็นภาพที่เกิดจากการสร้างขึ้น ตัดต่อ เติม หรือดัดแปลง ด้วยวิธีการทางอิเล็กทรอนิกส์หรือวิธีการอื่นใด โดยประการที่น่าจะทำให้ผู้อื่นนั้นเสียชื่อเสียง ถูกดูหมิ่น ถูกเกลียดชัง หรือได้รับความอับอาย
	           <br />ถ้าการกระทำตามวรรคหนึ่งเป็นการกระทำต่อภาพของผู้ตาย และการกระทำนั้นน่าจะทำให้บิดา มารดา คู่สมรส หรือบุตรของผู้ตายเสียชื่อเสียง ถูกดูหมิ่น หรือถูกเกลียดชัง หรือได้รับความอับอาย</span>
          </h4>
          <h4>>>> บทลงโทษ
            <span>จำคุกไม่เกิน 3 ปี ปรับไม่เกิน 200,000 บาท</span>
          </h4>
        </div>
        <ul className='content2'>
          <li>การนำภาพดาราไปตัดต่อ และตกแต่งเรื่องขึ้นมา จนทำให้บุคคลนั้นเกิดความเสียหาย</li>
          <li>การโพสต์ภาพผู้เสียชีวิต จนทำให้บิดามารดา คู่สมรส หรือบุตรของผู้ตายเสียชื่อเสียง ถูกดูหมิ่นเกลียดชัง หรือได้รับความอับอาย</li>
        </ul>
      </div>
    )

    const page23 = (
      <div className='page-23'>
        <img src={char} alt='char' className='char' />
        <img src={name} alt='name' className='name' />

        <button className='start' onClick={() => changeScene(3)}>START GAME</button>
      </div>
    )

    return (
      <div className='scene-2'>
        {page === 1 && page1}
        {page === 2 && page2}
        {page === 3 && page3}
        {page === 4 && page4}
        {page === 5 && page5}
        {page === 6 && page6}
        {page === 7 && page7}
        {page === 8 && page8}
        {page === 9 && page9}
        {page === 10 && page10}
        {page === 11 && page11}
        {page === 12 && page12}
        {page === 13 && page13}
        {page === 14 && page14}
        {page === 15 && page15}
        {page === 16 && page16}
        {page === 17 && page17}
        {page === 18 && page18}
        {page === 19 && page19}
        {page === 20 && page20}
        {page === 21 && page21}
        {page === 22 && page22}
        {page === 23 && page23}

        {
          page > 1 && page <= 23 && (
            <Actions
              next={page !== 23}
              prev
              scene={page === 1 ? scene : page}
              page={page}
              changeScene={page === 1 ? changeScene : this.changePage}
              changePage={this.changePage}
              history={this.props.history}
            />
          )
        }
      </div>
    )
  }
}

export default Scene2
