export default [
  {
    id: 1,
    question: 'อินเทอร์เน็ต คืออะไร ?',
    choices: [
      'เครือข่ายของคอมพิวเตอร์ขนาดใหญ่ที่เชื่อมโยงเครือข่ายคอมพิวเตอร์ทั้งโลกเข้าไว้ด้วยกัน',
      'ฮาร์ดแวร์ที่ต่ออุปกรณ์พ่วงเข้าด้วยกันเป็นเครือข่ายคอมพิวเตอร์',
      'ฮาร์ดแวร์ที่ต่ออุปกรณ์พ่วงเข้าด้วยกันเป็นเครือข่ายคอมพิวเตอร์',
      'ฮาร์ดแวร์ที่ต่ออุปกรณ์พ่วงเข้าด้วยกันเป็นเครือข่ายคอมพิวเตอร์'
    ],
    anwers: 1
  },
  {
    id: 2,
    question: 'คำว่า “อินเทอร์เน็ต” เขียนเป็นภาษาอังกฤษว่าอะไร ?',
    choices: [
      'Intorned',
      'Interned',
      'Internet',
      'Intornet'
    ],
    anwers: 3
  },
  {
    id: 3,
    question: 'Internet ย่อมาจากคำว่าอะไร ?',
    choices: [
      'International Network',
      'Internation Network',
      'Internet Work',
      'Internet Working'
    ],
    anwers: 2
  },
  {
    id: 4,
    question: 'ข้อใดกล่าวถูกเกี่ยวกับประโยชน์ของอินเทอร์เน็ต ?',
    choices: [
      'เกิดปัญหาละเมิดลิขสิทธิ์',
      'สามารถติดต่อสื่อสารกับคนอื่นได้ทั่วโลก',
      'ก่อให้เกิดปัญหาด้านอาชญากรรม',
      'ฮาร์ดแวร์ที่ต่ออุปกรณ์พ่วงเข้าด้วยกันเป็นเครือข่ายคอมพิวเตอร์'
    ],
    anwers: 2
  },
  {
    id: 5,
    question: 'ข้อใด คือ ประโยชน์ของอินเทอร์เน็ตในด้านความบันเทิง ?',
    choices: [
      'E-Learning',
      'E-Book',
      'CAI',
      'Game'
    ],
    anwers: 4
  },
  {
    id: 6,
    question: 'การใช้ E-Learning เป็นประโยชน์ของการใช้อินเทอร์เน็ตด้านใด ?',
    choices: [
      'อุตสาหกรรม',
      'การขนส่ง',
      'การศึกษา',
      'ความบันเทิง'
    ],
    anwers: 3
  },
  {
    id: 7,
    question: 'ข้อใดกล่าวถึงโทษของอินเทอร์เน็ตได้ถูกต้อง ?',
    choices: [
      'สามารถติดต่อกันได้ทั่วโลก',
      'สะดวกสบายในการหาข้อมูล',
      'แลกเปลี่ยนเรียนรู้กับผู้อื่นได้',
      'เกิดปัญหาของการละเมิดลิขสิทธิ์'
    ],
    anwers: 4
  },
  {
    id: 8,
    question: 'การส่ง E-Mail ไปตำหนิเพื่อน ถือว่าเป็นโทษของการใช้อินเทอร์เน็ตใช่หรือไม่ ?',
    choices: [
      'ใช่',
      'ไม่ใช่'
    ],
    anwers: 1
  },
  {
    id: 9,
    question: 'การซื้อสินค้าผ่านเว็บไซต์เป็นประโยชน์ของการใช้อินเทอร์เน็ตด้านใด ?',
    choices: [
      'ด้านความบันเทิง',
      'ด้านการศึกษา',
      'ด้านการสืบค้นข้อมูล',
      'ด้านธุรกิจ'
    ],
    anwers: 4
  },
  {
    id: 10,
    question: 'การดาวน์โหลดโปรแกรม Microsoft Word ถือว่าเป็นโทษของการใช้อินเทอร์เน็ตหรือไม่ ?',
    choices: [
      'ใช่',
      'ไม่ใช่'
    ],
    anwers: 2
  },
]
